
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ПриоритетСкладов.Записывать = Истина;
	Для Каждого ТекСтрокаСписок Из Список Цикл
		Движение = Движения.ПриоритетСкладов.Добавить();
		Движение.Период = Дата;
		Движение.Склад = ТекСтрокаСписок.Склад;
		Движение.Приоритет = ТекСтрокаСписок.Приоритет;
	КонецЦикла;
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПриоритетСкладов
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
